000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PRACTICE.
000300 AUTHOR. Joe, Mubarak.
000400 DATE-WRITTEN. 02/27/2025.
000500 ENVIRONMENT DIVISION.
000600 INPUT-OUTPUT SECTION.
000700 FILE-CONTROL.
000800*Specifies that the program will be working with the file
000900*that is given through standard input
001000     SELECT GRADES-FILE ASSIGN TO FILENAME
001100     ORGANIZATION IS LINE SEQUENTIAL.
001200 DATA DIVISION.
001300 FILE SECTION.
001400*Defines the structure of the data inside the file
001500 FD GRADES-FILE.
001600 01 STUDENT-ENTRY.
001700     05 STUDENT-ENTRY-NAME PIC X(8).
001800     05 STUDENT-GRADE PIC 99V99.
001900 WORKING-STORAGE SECTION.
002000*Record used for storing the name and grade of a student
002100 01 STUDENT.
002200     05 STUDENT-NAME PIC X(8).
002300     05 GRADE PIC 99V99.
002400*Other variables needed throughout the program
002500 01 FILENAME PIC X(64).
002600 01 GRADES-TOTAL PIC 9(4)V99 VALUE 0.
002700 01 STUDENT-COUNT PIC 99 VALUE 0.
002800 01 AVERAGE PIC 99V99.
002900 01 RESPONSE PIC X(1).
003000 01 GRADE-INPUT PIC 99V999.
003100 01 EOF-FLAG PIC 9 VALUE 0.
003200     88 EOF-TRUE VALUE 1.
003300     88 EOF-FALSE VALUE 0.
003400
003500 PROCEDURE DIVISION.
003600 MAIN.
003700*    Get the filename from the user
003800     DISPLAY "Enter the filename: " WITH NO ADVANCING.
003900     ACCEPT FILENAME.
004000
004100     DISPLAY
004200     "Would you like to append entries? (y for yes): "
004300     WITH NO ADVANCING.
004400     ACCEPT RESPONSE.
004500
004600     IF RESPONSE = "y"
004700         PERFORM ADD-ENTRIES
004800     END-IF.
004900
005000*    Loop over each entry in the grades file
005100     PERFORM CALCULATE-AVERAGE.
005200     DISPLAY "Average Grade: " AVERAGE "%".
005300     STOP RUN.
005400
005500*Add entries to the end of the file at request of the user
005600 ADD-ENTRIES.
005700     OPEN EXTEND GRADES-FILE
005800     DISPLAY "Student Name (0 to quit): " WITH NO ADVANCING
005900     ACCEPT STUDENT-NAME
006000     PERFORM UNTIL STUDENT-NAME = "0"
006100         DISPLAY "Student Grade: " WITH NO ADVANCING
006200         ACCEPT GRADE-INPUT
006300         MOVE GRADE-INPUT TO GRADE
006400         WRITE STUDENT-ENTRY FROM STUDENT
006500         DISPLAY "Student Name (0 to quit): " WITH NO ADVANCING
006600         ACCEPT STUDENT-NAME
006700     END-PERFORM.
006800     CLOSE GRADES-FILE.
006900
007000*Calculates the average grade
007100 CALCULATE-AVERAGE.
007200     OPEN INPUT GRADES-FILE.
007300     PERFORM UNTIL EOF-TRUE
007400         READ GRADES-FILE INTO STUDENT
007500             AT END MOVE 1 TO EOF-FLAG
007600             NOT AT END PERFORM PROCESS_ENTRY
007700         END-READ
007800     END-PERFORM.
007900     CLOSE GRADES-FILE.
008000     DIVIDE GRADES-TOTAL BY STUDENT-COUNT GIVING AVERAGE.
008100
008200*Add the current student's grade to the total
008300 PROCESS_ENTRY.
008400     ADD GRADE TO GRADES-TOTAL.
008500     ADD 1 TO STUDENT-COUNT.
